---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IExternalEventHandler Methods
IExternalEventHandler Interface See Also Send Feedback
---

The IExternalEventHandler type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | Execute | This method is called to handle the external event. |
|  | GetName | String identification of the event handler. |

# See Also

IExternalEventHandler Interface

Autodesk.Revit.UI Namespace